examples/cavityExample/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    tube_inlet
    {
        type            fixedValue;
        value           uniform 22.4;
    }
    tube_outlet
    {
        type            zeroGradient;
    }
    tube_wall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    shell_inlet
    {
        type            fixedValue;
        value           uniform 22.4;
    }
    shell_outlet
    {
        type            zeroGradient;
    }
    shell_wall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
}


// ************************************************************************* //

