examples/cavityExample/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    tube_baffle
    {
        type        faceZone;
        zoneName    tube_wall;

        owner
        {
            name        tube_to_shell;
            type        mappedWall;
            neighbourRegion shell_fluid;
            neighbourPatch shell_to_tube;
        }

        neighbour
        {
            name        shell_to_tube;
            type        mappedWall;
            neighbourRegion tube_fluid;
            neighbourPatch tube_to_shell;
        }
    }
}


// ************************************************************************* //
